<?php
/**
 * @category BaseService
 * @author   gouki <gouki.xiao@gmail.com>
 * @created 02/01/2018 18:14
 * @since
 */

namespace application\models\service;

use yii\base\Component;

class BaseService extends Component
{
    public $options = [
        'gender'                 => ["男", "女"],
        'education'              => ["文盲", "小学", "初中", "高中/中专", "大专/大学", "研究生及以上"],
        'marriage'               => ["未婚", "已婚", "同居", "离异或丧偶", "保密"],
        'job'                    => ["学生", "餐饮食品业", "商业服务业", "医务人员", "自由职业", "离退休人员", "待业", "其他"],
        'income'                 => ["无收入", "0-1000元", "1001-2999元", "3000-4999元", "5000-9999元", "10000-19999元", "2万元以上"],
        'household'              => ['本市', '本省外市', '外省', '外籍'],
        'livetime'               => ['<3月', '3-6月', '6月-1年', '1-5年', '5年以上'],
        'nation'                 => [
            "汉族",
            "壮族",
            "满族",
            "回族",
            "苗族",
            "维吾尔族",
            "土家族",
            "彝族",
            "蒙古族",
            "藏族",
            "布依族",
            "侗族",
            "瑶族",
            "朝鲜族",
            "白族",
            "哈尼族",
            "哈萨克族",
            "黎族",
            "傣族",
            "畲族",
            "傈僳族",
            "仡佬族",
            "东乡族",
            "高山族",
            "拉祜族",
            "水族",
            "佤族",
            "纳西族",
            "羌族",
            "土族",
            "仫佬族",
            "锡伯族",
            "柯尔克孜族",
            "达斡尔族",
            "景颇族",
            "毛南族",
            "撒拉族",
            "布朗族",
            "塔吉克族",
            "阿昌族",
            "普米族",
            "鄂温克族",
            "怒族",
            "京族",
            "基诺族",
            "德昂族",
            "保安族",
            "俄罗斯族",
            "裕固族",
            "乌孜别克族",
            "门巴族",
            "鄂伦春族",
            "独龙族",
            "塔塔尔族",
            "赫哲族",
            "珞巴族"
        ],
        'sex_type'               => ["阴道交", "口交", '肛交', '手淫', '乳交', '器具', '其他'],
        'sex_direction'          => ["同性", "异性", "双向", "不确定"],
        'condom_percent'         => ["100%", "80-99%", "60-79%", "40-59%", "20-39%", '1-19%', '0%'],
        'anal_sex_percent'       => ["100%", "80-99%", "60-79%", "40-59%", "20-39%", '1-19%', '0%'],
        'anal_sex_near'          => ["是", "否", "没有发生性行为"],
        'anal_sex_role'          => ["完全是主动肛交（纯1）", "主要是主动肛交（主要是1）", "两者兼有，两者差不多", "主要是被动肛交（主要是0）", "完全被动肛交（纯0）"],
        'drug_type'              => ['海洛因', '可卡因', '零号胶囊', 'Rush', '大麻', '吗啡', 'K粉(氯氨酮) ', '摇头丸', '麻古', '其他'],
        'drug_rate'              => [">=1次/天", "1-6次/周", '1-3次/月', '<1次/月'],
        'pinhead_near_month_num' => ["未共用", "有时共用", "每次都共用"],
        'last_hiv_checkdate_choose' => ['不记得日期', '从未检测过'],
        'hiv_check_mode'            => ['主动', '被动'],
        'hiv_check_reason'          => [
            '注射毒品史',
            '配偶/固定性伴阳性史',
            '男男性行为史',
            '商业异性性行为史',
            '非商非固定异性性行为史',
            '献血浆史',
            '输血/血制品史',
            '职业暴露史',
            '母亲阳性史',
            '手术史',
            '无高危行为史',
            '其他'
        ],
        'last_hiv_check_mode'      => ['医院检测', '社区组织提供HIV检测', '疾控中心', 'VCT门诊检测', '从未检测过', '其他'],
        'hiv_check_care'           => [
            '检测需要实名',
            '自认为感染HIV的风险低',
            '等待检测结果的时间过长',
            '担心检测阳性后信息暴露',
            '担心感染而不愿意去检测',
            '距检测地点较远交通不便',
            '其他'
        ],
        'hiv_check_time'           => ['1个月', '2个月', '3个月', '6个月', '一年', '不想再测'],

        'partner_is_check_hiv'     => ["是", "否", '不知道'],
        'partner_check_result'     => ["阳性", "阴性", "不知道"],


    ];

}
